app/controllers/products_controller.rb

SELECT  "products".* FROM "products" LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "products"
---
  def index
    @products = Product.paginate(page: params[:page], per_page: 10)