app/views/products/index.html.erb

        <ul>
        <% Category.all.each do |category| %>
---
SELECT "categories".* FROM "categories"